# Homework 2: Pandas DataFrames
Dr. Leslie Kerby </br>
Data Science and Applied Machine Learning </br>
Student's name: Ziming Wang

In [8]:
import numpy as np
import pandas as pd

## 1. World Population

**Question 1.1**<br/>
Read in the 'world_population.csv' file. Adjust your DataFrame to keep only the 'Year' and 'Population' columns. Show the first 5 elements with the `head` method.

In [2]:
world_pop = pd.read_csv('https://raw.githubusercontent.com/LGKerby/Python/master/world_population.csv',usecols=['Year','Population'])
world_pop.head(5)

   Year  Population
0  1950  2557628654
1  1951  2594939877
2  1952  2636772306
3  1953  2682053389
4  1954  2730228104

**Question 1.2**<br/>
How many rows (years) are in the DataFrame? Use python code to give the answer.

In [9]:
len(world_pop['Year'])

66

**Question 1.3**<br/>
What was the population of the world in 1976? Use python code to give the answer.

In [10]:
answer = world_pop[world_pop['Year'] == 1976]['Population']
answer.item()

4160185010

**Question 1.4**<br/>
Use a boolean mask to create a DataFrame called `last_quartile` that contains the world population from years 1975 to 1999. You may do this in two steps (use two boolean masks) or you may do this in one step using the 'and' operator `&`.

*Hint:* For example, to select the years 1960 and 1970 from the DataFrame you would use the 'or' operator `|`:<br/>
`population[ (population['Year'] == 1960) | (population['Year'] == 1970) ]`

In [11]:
last_quartile = world_pop[ (world_pop['Year'] >= 1975) & (world_pop['Year'] <= 1999) ]
last_quartile

    Year  Population
25  1975  4089083233
26  1976  4160185010
27  1977  4232084578
28  1978  4304105753
29  1979  4379013942
30  1980  4451362735
31  1981  4534410125
32  1982  4614566561
33  1983  4695736743
34  1984  4774569391
35  1985  4856462699
36  1986  4940571232
37  1987  5027200492
38  1988  5114557167
39  1989  5201440110
40  1990  5288955934
41  1991  5371585922
42  1992  5456136278
43  1993  5538268316
44  1994  5618682132
45  1995  5699202985
46  1996  5779440593
47  1997  5857972543
48  1998  5935213248
49  1999  6012074922

**Question 1.5**<br/>
Now find the average of the world population in `last_quartile`. Use numpy to find the average.

In [12]:
np.mean(last_quartile['Population'])

5037315305.76

## 2. Top Movies ##

**Question 2.1**<br/>
Read in 'top_movies.csv' into a DataFrame called `top_movies`. Show the first 5 rows with `head`.

In [14]:
movies = pd.read_csv('https://raw.githubusercontent.com/LGKerby/Python/master/top_movies.csv')
movies.head(5)

                          Title                Studio  ...  Gross (Adjusted)  Year
0  Star Wars: The Force Awakens  Buena Vista (Disney)  ...         906723400  2015
1                        Avatar                   Fox  ...         846120800  2009
2                       Titanic             Paramount  ...        1178627900  1997
3                Jurassic World             Universal  ...         687728000  2015
4         Marvel's The Avengers  Buena Vista (Disney)  ...         668866600  2012

[5 rows x 5 columns]

**Question 2.2**<br/>
What movies were released in 2005? Use python to show just the movies titles (column).

In [15]:
movies[movies['Year'] == 2005]['Title']

24         Star Wars: Episode III - Revenge of the Sith
60    The Chronicles of Narnia: The Lion, the Witch ...
62                  Harry Potter and the Goblet of Fire
Name: Title, dtype: object

**Question 2.3**<br/>
Use a boolean mask to create a DataFrame called `paramount` that contains only movies produced by 'Paramount'.

In [16]:
paramount = movies[movies['Studio'] == 'Paramount']
paramount

                                                 Title  ...  Year
2                                              Titanic  ...  1997
39                                        Forrest Gump  ...  1994
42                                            Iron Man  ...  2008
44   Indiana Jones and the Kingdom of the Crystal S...  ...  2008
46                                          Iron Man 2  ...  2010
77                             Raiders of the Lost Ark  ...  1981
84                                   Beverly Hills Cop  ...  1984
92                                               Ghost  ...  1990
95                              Mission: Impossible II  ...  2000
101                 Indiana Jones and the Last Crusade  ...  1989
103                                             Grease  ...  1978
109                                Mission: Impossible  ...  1996
110               Indiana Jones and the Temple of Doom  ...  1984
111                                            Top Gun  ...  1986
115                                   Crocodile Dundee  ...  1986
124                                           The Firm  ...  1993
125                                   Fatal Attraction  ...  1987
128                               Beverly Hills Cop II  ...  1987
135                                      The Godfather  ...  1972
138                         An Officer and a Gentleman  ...  1982
151                                         Love Story  ...  1970
160                               Saturday Night Fever  ...  1977
174                               The Ten Commandments  ...  1956
188                                        Rear Window  ...  1954
190                         The Greatest Show on Earth  ...  1952

[25 rows x 5 columns]

**Question 2.4** <br/>
How many movies did Paramount produce? Use python to find the answer.

In [18]:
Number_movies = movies[movies['Studio'] == 'Paramount']
len(Number_movies['Title'])

25

**Question 2.5**<br/>
In what year was the first movie from Paramount (that appears in this top movies list)? Use python to find the answer.

In [19]:
movies[movies['Studio'] == 'Paramount']['Year'].min()

1952

**Question 2.6**<br/>
What was the name of that movie? Use python to show the answer.

In [20]:
movies[movies['Year'] == 1952]['Title']

190    The Greatest Show on Earth
Name: Title, dtype: object

**Question 2.7.** <br/>
What was the average Adjusted Gross for all the Paramount movies (in this top movies list)? Use numpy.

In [21]:
np.mean(movies[movies['Studio'] == 'Paramount']['Gross (Adjusted)'])

520560232.0